In [1]:
import pandas as pd
import os

In [2]:
df = pd.read_csv('nba_team_win.csv')
df.head()

      Year   Team Record   Win%
0  2017-18  Hawks  24-58  0.293
1  2016-17  Hawks  43-39  0.524
2  2015-16  Hawks  48-34  0.585
3  2014-15  Hawks  60-22  0.732
4  2013-14  Hawks  38-44  0.463

In [3]:
df.dropna(inplace = True)

In [4]:
new = df["Record"].str.split("-", n = 1, expand = True)

In [5]:
df["Wins"]= new[0]
df["Losses"]= new[1]

In [6]:
df.drop(columns = ["Record"], inplace = True)

In [7]:
df.to_csv('wins_losses.csv')

In [8]:
df.head()

      Year   Team   Win% Wins Losses
0  2017-18  Hawks  0.293   24     58
1  2016-17  Hawks  0.524   43     39
2  2015-16  Hawks  0.585   48     34
3  2014-15  Hawks  0.732   60     22
4  2013-14  Hawks  0.463   38     44

In [11]:
print(df.dtypes)

Year       object
Team       object
Win%      float64
Wins       object
Losses     object
dtype: object

In [14]:
df['new_year'] = df['Year'].str.split('-').str[0]

In [16]:
df.drop(columns = ["Year"], inplace = True)

In [17]:
df

         Team   Win% Wins Losses new_year
0       Hawks  0.293   24     58     2017
1       Hawks  0.524   43     39     2016
2       Hawks  0.585   48     34     2015
3       Hawks  0.732   60     22     2014
4       Hawks  0.463   38     44     2013
...       ...    ...  ...    ...      ...
1048  Bullets  0.488   40     42     1984
1049  Bullets  0.427   35     47     1983
1050  Bullets  0.512   42     40     1982
1051  Bullets  0.524   43     39     1981
1052  Bullets  0.476   39     43     1980

[1053 rows x 5 columns]

In [18]:
df.to_csv('wins_losses.csv')